Tekla Open API Reference for Tekla Structures 2025
Load.PrimaryAxisDirection Property
 The vector for the primary axis direction.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector PrimaryAxisDirection { get; set; }
Public Property PrimaryAxisDirection As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
Load Class
Tekla.Structures.Model Namespace